MicrochipTech/dspic33a-high-speed-adc-example/capture.c
/* A burst is in flight from here until the DMA DONE interrupt. */
static void start_burst(void)
{
    burst_active = true;
    adc_start_burst();
}

/* ------------------------------------------------------------------ *
 * Set-up: the DMA channel, wired to this ADC core and this buffer
 * ------------------------------------------------------------------ */
void capture_init(void)
{
    for (uint32_t i = 0; i < BUF_GUARD_WORDS; i++) {
        dma_buffer.guard[i] = BUF_GUARD_PATTERN(i);
    }
    /* The buffer object itself and its size - not a constant that has to
     * agree with it. The ADC's burst length (adc_init, SAMPLES_PER_BUF)
     * must equal the block, which the check below pins down. */
    dma0_init(DMA_TRIG_ADC_CH0, &ADCREG(CH0RES), dma_buffer.data, sizeof dma_buffer.data);
}
_Static_assert(sizeof dma_buffer.data == SAMPLES_PER_BUF * sizeof(uint16_t),
               "ADC burst length and DMA buffer size must be the same thing");

/* Stop with code 11 if anything wrote past the end of the buffer. */
static void guard_check(void)
{
    for (uint32_t i = 0; i < BUF_GUARD_WORDS; i++) {
        if (dma_buffer.guard[i] != BUF_GUARD_PATTERN(i)) {
            console_kv("[guard] word behind the buffer changed, index", i);
            console_kv_hex("[guard] value", dma_buffer.guard[i]);
            console_kv_hex("[guard] expected", BUF_GUARD_PATTERN(i));
            fail(11u);
        }
    }
}

/* Switch the stream off hard, so that a 40 MSPS stream does not keep
 * hammering the bus while fail() or a trap handler prints. */
void capture_halt(void)
{
    dma0_halt();
}

/* ------------------------------------------------------------------ *
 * DMA event - one per buffer half, called from the DMA0 interrupt
 *
 * HALF: the first half is complete, the DMA is filling the second.
 * DONE: the second half is complete, the DMA has reloaded to the start
 *       and the ADC burst has ended - apply a pending input change and,
 *       if the stream is enabled, start the next burst here.
 *
 * Runs in the interrupt, priority 4 (IPC9 default). The console's UART
 * receive interrupt runs at priority 1, so this preempts a running
 * command.
 *
 * Deliberately short. Everything this counts is a hardware flag, so a
 * long handler would itself become the reason for the next overrun.
 * ------------------------------------------------------------------ */
void dma0_event(uint32_t st)
{
    if (st & DMA0_OVERRUN) {
        /* Triggered while the previous transfer was still in progress
         * (p816): the bus did not keep up. This is the measurement. */
        dma_overrun++;
        dma0_clear(DMA0_OVERRUN);
    }
    if (st & DMA0_ADRERR) {
        dma_addr_err++;
        dma0_clear(DMA0_ADRERR);
    }
    if (st & (DMA0_BRERR | DMA0_BWERR)) {
        dma_bus_err++;
        dma0_clear(DMA0_BRERR | DMA0_BWERR);
    }

    /* Both halves pending at once means this handler arrived more than
     * one half (25.6 us) late and the first half has already been
     * overwritten by the DMA reload. */
    if ((st & DMA0_HALF) && (st & DMA0_DONE)) {
        late_service++;
    }

    if (st & DMA0_HALF) {
        dma0_clear(DMA0_HALF);
        ready_half  = 0u;
        last_sample = buf[SAMPLES_PER_HALF - 1u];
        blocks_done++;
    }
    if (st & DMA0_DONE) {
        dma0_clear(DMA0_DONE);
        ready_half  = 1u;
        last_sample = buf[SAMPLES_PER_BUF - 1u];
        blocks_done++;

        /* The channel is idle between bursts: this is the only safe
         * moment to change its input or sample time. */
        if (switch_pending) {
            adc_set_input(pinsel_next, samc_next);
            switch_pending = false;
        }
        if (pacing_pending) {
            /* Never involves the clock-divider source: those switches
             * go through quiesce() in capture_set_pacing(). */
            adc_set_trg2((pacing_next == ADC_PACE_CLKDIV) ? ADC_TRG2_B2B : pacing_next);
            pacing_cur     = pacing_next;
            pacing_pending = false;
        }
        if (period_pending) {
            apply_period(period_next);
            period_pending = false;
        }
        if (run_enabled) {
            start_burst();            /* next SAMPLES_PER_BUF samples   */
        } else {
            burst_active = false;
        }
    }
}

/* ------------------------------------------------------------------ *
 * Control API (capture.h)
 * ------------------------------------------------------------------ */
void capture_start(void)
{
    run_enabled = true;
    if (!burst_active) {
        start_burst();
    }
}

void capture_stop(void)
{
    run_enabled = false;
}

bool capture_running(void)
{
    return run_enabled;
}

bool capture_burst_active(void)
{
    return burst_active;
}

bool capture_set_input(uint8_t pinsel, uint8_t samc)
{
    if ((pinsel > 15u) || (samc > 31u)) {
        return false;
    }
    pinsel_next = pinsel;
    samc_next   = samc;
    switch_pending = true;
    if (!burst_active) {
        /* Nothing running: apply right away, the channel is idle. */
        adc_set_input(pinsel, samc);
        switch_pending = false;
    }
    return true;
}

uint8_t capture_pinsel(void) { return adc_pinsel(); }
uint8_t capture_samc(void)   { return adc_samc(); }

/* ------------------------------------------------------------------ *
 * Pacing (capture.h): which trigger sets the rate, and its period
 * ------------------------------------------------------------------ */
static const uint32_t sweep_repeat[] = { 63u, 32u, 16u, 8u, 4u, 3u, 2u };  /* 1.27..40 MSPS */
static const uint32_t sweep_sccp[]   = { 80u, 40u, 20u, 10u, 8u, 5u, 4u }; /* 1.25..25 MSPS */
static const uint32_t sweep_b2b[]    = { 0u };                             /* one row       */
/* ADC clock divider: ratio 10, 8, 6, 4, 2, 1 = 4, 5, 6.7, 10, 20, 40 MSPS
 * (32 MHz is the ADC clock minimum, so 10 is the largest ratio). */
static const uint32_t sweep_clkdiv[] = { 10u, 8u, 6u, 4u, 2u, 1u };

bool capture_set_pacing(uint8_t pacing)
{
    uint32_t period;
    switch (pacing) {
    case ADC_TRG2_REPEAT:  period = ADC_RPTCNT;     break;
    case ADC_TRG2_SCCP1:   period = ADC_SCCP_TICKS; break;
    case ADC_PACE_CLKDIV:  period = ADC_CLKDIV;     break;
    case ADC_TRG2_B2B:     period = 0u;             break;
    default:               return false;
    }
    if (pacing != ADC_TRG2_SCCP1) { sccp1_stop(); }
    /* Into or out of the clock-divider source the ADC is switched off
     * and on: not between two bursts in the ISR, but now, with the
     * stream stopped and restarted around it. */
    bool restart = false;
    if ((pacing == ADC_PACE_CLKDIV) || (pacing_cur == ADC_PACE_CLKDIV)) {
        restart = quiesce();
    }
    /* Leaving the clock-divider source: back to the full ADC clock, so
     * that the other sources' units (TAD, 10 ns ticks) mean what the
     * comments say. */
    if ((pacing_cur == ADC_PACE_CLKDIV) && (pacing != ADC_PACE_CLKDIV)) {
        (void)adc_clock_switch(1u);
    }
    pacing_next    = pacing;
    pacing_pending = true;
    period_next    = period;
    period_pending = true;
    if (!burst_active) {
        adc_set_trg2((pacing == ADC_PACE_CLKDIV) ? ADC_TRG2_B2B : pacing);
        pacing_cur = pacing;
        apply_period(period);
        pacing_pending = period_pending = false;
    }
    if (restart) { capture_start(); }
    return true;
}

uint8_t capture_pacing(void) { return pacing_cur; }

const char *capture_pacing_name(void)
{
    switch (pacing_cur) {
    case ADC_TRG2_REPEAT:  return "ADC repeat timer (period in TAD = 12.5 ns)";
    case ADC_TRG2_SCCP1:   return "SCCP1 timer (period in ticks of 10 ns)";
    case ADC_PACE_CLKDIV:  return "ADC clock divider (period = divide ratio of 320 MHz, back-to-back)";
    case ADC_TRG2_B2B:     return "back-to-back (no rate control)";
    default:               return "unknown pacing";
    }
}

bool capture_set_period(uint32_t period)
{
    switch (pacing_cur) {
    case ADC_TRG2_REPEAT:  if ((period < 2u) || (period > 63u))    { return false; } break;
    case ADC_TRG2_SCCP1:   if ((period < 2u) || (period > 65535u)) { return false; } break;
    case ADC_PACE_CLKDIV:  if ((period != 1u) && ((period < 2u) || (period > 10u) || (period % 2u != 0u))) { return false; } break;
    default:               return false;
    }
    if (pacing_cur == ADC_PACE_CLKDIV) {
        /* ADC off and on around the clock switch: stop the stream, do
         * it now, restart. Not deferred to the DONE moment. */
        const bool restart = quiesce();
        const bool ok      = adc_clock_switch(period);
        period_pending     = false;
        if (restart) { capture_start(); }
        return ok;
    }
    period_next    = period;
    period_pending = true;
    if (!burst_active) {
        apply_period(period);
        period_pending = false;
    }
    return true;
}

