MicrochipTech/dspic33a-high-speed-adc-example/capture.c
    console_puts("[ratetest] pacing: ");
    console_puts(capture_pacing_name());
    console_puts("\r\n");

    switch (pacing) {
    case ADC_TRG2_REPEAT: periods[0] = 16u; periods[1] = 4u; break;  /* 5 / 20 MSPS */
    case ADC_TRG2_SCCP1:  periods[0] = 20u; periods[1] = 5u; break;  /* 5 / 20 MSPS */
    case ADC_PACE_CLKDIV: periods[0] = 8u;  periods[1] = 2u; break;  /* 5 / 20 MSPS */
    default:
        /* Back-to-back: nothing to judge against, just say what it delivers. */
        rc = rate_measure(0u, &ksps[0]);
        if (rc == 0u) {
            console_kv("[ratetest]   measured ksps (no period to compare with)", ksps[0]);
        } else {
            console_puts("[ratetest]   no data\r\n");
        }
        goto restore;
    }

    for (uint32_t i = 0; (i < 2u) && (rc == 0u); i++) {
        rc = rate_measure(periods[i], &ksps[i]);
        if (rc == 0u) {
            const uint32_t nominal = capture_nominal_ksps(periods[i]);
            const uint32_t diff    = (ksps[i] > nominal) ? ksps[i] - nominal : nominal - ksps[i];
            console_kv("[ratetest]   period", periods[i]);
            console_kv("[ratetest]     nominal ksps", nominal);
            console_kv("[ratetest]     measured ksps", ksps[i]);
            if (diff > nominal * RATETEST_TOL_PCT / 100u) {
                console_puts("[ratetest]     outside the 10 % window\r\n");
                rc = 12u;
            }
        } else {
            console_kv("[ratetest]   no data at period", periods[i]);
        }
    }
    if (rc == 0u) {
        /* The short period must deliver four times the rate (3..5x). */
        if ((ksps[1] < 3u * ksps[0]) || (ksps[1] > 5u * ksps[0])) {
            console_puts("[ratetest]   the rate does not follow the period\r\n");
            rc = 12u;
        }
    }

restore:
    if (keep != 0u) { (void)capture_set_period(keep); }
    counters_clear();
    if (was_running) { capture_start(); }
    console_puts((rc == 0u) ? "[ratetest]   PASS\r\n" : "[ratetest]   FAIL\r\n");
    return rc;
#endif
}

uint32_t capture_autopace(void)
{
    console_kv("[pacing] time base check, ticks per 100 ms (expect 1250000)", timebase_check());
#if ADC_PACING != 0u
    (void)capture_set_pacing((uint8_t)ADC_PACING);
    console_puts("[pacing] fixed by ADC_PACING: ");
    console_puts(capture_pacing_name());
    console_puts("\r\n");
    return capture_ratetest();
#else
    static const uint8_t candidates[4] = { ADC_TRG2_REPEAT, ADC_TRG2_SCCP1, ADC_PACE_CLKDIV, ADC_TRG2_B2B };
    uint32_t result[4];
    uint8_t  chosen = ADC_TRG2_B2B;
    bool     have   = false;

    for (uint32_t i = 0; i < 4u; i++) {
        (void)capture_set_pacing(candidates[i]);
        result[i] = capture_ratetest();
        if ((result[i] == 0u) && !have && (candidates[i] != ADC_TRG2_B2B)) {
            chosen = candidates[i];
            have   = true;
        }
    }
    (void)capture_set_pacing(chosen);

    console_puts("[pacing] summary: repeat timer ");
    console_puts((result[0] == 0u) ? "PASS" : "FAIL");
    console_puts(", SCCP1 timer ");
    console_puts((result[1] == 0u) ? "PASS" : "FAIL");
    console_puts(", ADC clock divider ");
    console_puts((result[2] == 0u) ? "PASS" : "FAIL");
    console_puts(", back-to-back ");
    console_puts((result[3] == 0u) ? "runs" : "no data");
    console_puts("\r\n[pacing] using: ");
    console_puts(capture_pacing_name());
    console_puts(have ? "\r\n"
                      : " - NO PACED SOURCE PASSED, the rate is not under control\r\n");
    return 0u;
#endif
}

void capture_regs_dump(void)
{
    console_puts("[regs] counters\r\n");
    console_kv("blocks_done", blocks_done);
    console_kv("dma_overrun", dma_overrun);
    console_kv("late_service", late_service);
    console_kv("proc_missed", proc_missed);
    console_kv("dma_addr_err", dma_addr_err);
    console_kv("dma_bus_err", dma_bus_err);
    console_kv("selftest_mean", selftest_mean);
    /* The guard words behind the buffer: all must read 0xA5C3F00D + i. */
    console_kv_hex("buf", (uint32_t)buf);
    console_kv_hex("buf_end", (uint32_t)&buf[SAMPLES_PER_BUF]);
    console_kv_hex("guard0", dma_buffer.guard[0]);
    console_kv_hex("guard1", dma_buffer.guard[1]);
    console_kv_hex("guard15", dma_buffer.guard[BUF_GUARD_WORDS - 1u]);
}
